##### Testing for the second project of freeCodeCamp's Data Analysis with Python certificate. Here, a much more clear Jupyter Notebooks file is used to showcase the steps taken to answer a few questions using the provided csv (adult.data.csv).

In [58]:
import pandas as pd
import numpy as np

In [59]:
df = pd.read_csv('adult.data.csv')
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [60]:
df.value_counts

<bound method DataFrame.value_counts of        age         workclass  fnlwgt   education  education-num  \
0       39         State-gov   77516   Bachelors             13
1       50  Self-emp-not-inc   83311   Bachelors             13
2       38           Private  215646     HS-grad              9
3       53           Private  234721        11th              7
4       28           Private  338409   Bachelors             13
...    ...               ...     ...         ...            ...
32556   27           Private  257302  Assoc-acdm             12
32557   40           Private  154374     HS-grad              9
32558   58           Private  151910     HS-grad              9
32559   22           Private  201490     HS-grad              9
32560   52      Self-emp-inc  287927     HS-grad              9

           marital-status         occupation   relationship   race     sex  \
0           Never-married       Adm-clerical  Not-in-family  White    Male
1      Married-civ-spouse    Exec-managerial        Husband  White    Male
2                Divorced  Handlers-cleaners  Not-in-family  White    Male
3      Married-civ-spouse  Handlers-cleaners        Husband  Black    Male
4      Married-civ-spouse     Prof-specialty           Wife  Black  Female
...                   ...                ...            ...    ...     ...
32556  Married-civ-spouse       Tech-support           Wife  White  Female
32557  Married-civ-spouse  Machine-op-inspct        Husband  White    Male
32558             Widowed       Adm-clerical      Unmarried  White  Female
32559       Never-married       Adm-clerical      Own-child  White    Male
32560  Married-civ-spouse    Exec-managerial           Wife  White  Female

       capital-gain  capital-loss  hours-per-week native-country salary
0              2174             0              40  United-States  <=50K
1                 0             0              13  United-States  <=50K
2                 0             0              40  United-States  <=50K
3                 0             0              40  United-States  <=50K
4                 0             0              40           Cuba  <=50K
...             ...           ...             ...            ...    ...
32556             0             0              38  United-States  <=50K
32557             0             0              40  United-States   >50K
32558             0             0              40  United-States  <=50K
32559             0             0              20  United-States  <=50K
32560         15024             0              40  United-States   >50K

[32561 rows x 15 columns]>

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [62]:
df.describe()

,age,fnlwgt,education-num,capital-gain,capital-loss,hours-per-week
count,32561.000000,3.256100e+04,32561.000000,32561.000000,32561.000000,32561.000000
mean,38.581647,1.897784e+05,10.080679,1077.648844,87.303830,40.437456
std,13.640433,1.055500e+05,2.572720,7385.292085,402.960219,12.347429
min,17.000000,1.228500e+04,1.000000,0.000000,0.000000,1.000000
25%,28.000000,1.178270e+05,9.000000,0.000000,0.000000,40.000000
50%,37.000000,1.783560e+05,10.000000,0.000000,0.000000,40.000000
75%,48.000000,2.370510e+05,12.000000,0.000000,0.000000,45.000000
max,90.000000,1.484705e+06,16.000000,99999.000000,4356.000000,99.000000

### First question:
##### How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

In [171]:
races = df['race'].value_counts()
races.name = 'Race Value Counts'
print(races)

race
White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: Race Value Counts, dtype: int64

### Second question:
##### What is the average age of men?

In [161]:
#mask = df['sex'] == 'Male'
#male_age_avg = df.loc[mask, 'age']
#float(round(male_age_avg.mean(), 1))

avg_men_age = float(round(df.loc[df['sex'] == 'Male', 'age'].mean(), 1))
print(f"The average age in men in the database is {avg_men_age} years old.")

The average age in men in the database is 39.4 years old.

### Second question:
##### What is the percentage of people who have a Bachelor's degree?

In [79]:
df['education'].value_counts()

education
HS-grad         10501
Some-college     7291
Bachelors        5355
Masters          1723
Assoc-voc        1382
11th             1175
Assoc-acdm       1067
10th              933
7th-8th           646
Prof-school       576
9th               514
12th              433
Doctorate         413
5th-6th           333
1st-4th           168
Preschool          51
Name: count, dtype: int64

In [172]:
per_w_bach = float((round(((df['education'] == 'Bachelors').sum() / df.shape[0]) * 100, 1)))
print(f"Percentage of people who hold a bachelor's degree: {per_w_bach}%")

Percentage of people who hold a bachelor's degree: 16.4%

### Third question:

##### What percentage of people with advanced education (Bachelors, Masters, or Doctorate) make more than 50K? And what percentage of people without advanced education make more than 50K?

##### Percentage of people with and without advanced education.

In [120]:
df['salary'].value_counts()

salary
<=50K    24720
>50K      7841
Name: count, dtype: int64

In [149]:
per_w_adv_ed = float(round((((df['education'].isin(['Bachelors', 'Masters', 'Doctorate']))).sum() / (df.shape[0])) * 100, 1))
per_wo_adv_ed = float(round((((~df['education'].isin(['Bachelors', 'Masters', 'Doctorate']))).sum() / (df.shape[0])) * 100, 1))

print(f"Percentage with advanced education: {per_w_adv_ed}%\nPercentage without advanced education: {per_wo_adv_ed}%")

Percentage with advanced education: 23.0%
Percentage without advanced education: 77.0%

In [151]:
per_w_adv_ed_n_rich = float(round((((df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) & (df['salary'] == '>50K')).sum() / (df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])).sum()) * 100, 1))
per_wo_adv_ed_n_rich = float(round((((~df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])) & (df['salary'] == '>50K')).sum() / (~df['education'].isin(['Bachelors', 'Masters', 'Doctorate'])).sum()) * 100, 1))

print(f"Percentage with advanced education who earn over 50K: {per_w_adv_ed_n_rich}%\nPercentage without advanced education who earn over 50K: {per_wo_adv_ed_n_rich}%")

Percentage with advanced education who earn over 50K: 46.5%
Percentage without advanced education who earn over 50K: 17.4%

### Fourth question:

##### What is the minimum number of hours a person works per week (hours-per-week feature)?
##### What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [173]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [ ]:
min_hrs_week = int(df['hours-per-week'].min())
print(f"The minimum number of hours worked by anyone within the scope of study is of {min_hrs_week} hours/week.")

The minimum number of hours worked by anyone within the scope of study is of 1 hours/week.

In [234]:
min_hrs_week_n_rich = float(round(((((df['hours-per-week'] == min_hrs_week) & (df['salary'] == '>50K')).sum()) / (df['hours-per-week'] == min_hrs_week).sum()) * 100, 1))
print(f"The percentage of people who work 1h/week and earn over 50K USD are {min_hrs_week_n_rich}% of the total.")

The percentage of people who work 1h/week and earn over 50K USD are 10.0% of the total.


### Fourth question:

##### What country has the highest percentage of people that earn >50K?

In [231]:
rich = df[df['salary'] == '>50K']
rich_counts = rich['native-country'].value_counts()
total_counts = df['native-country'].value_counts()

richest_country = (rich_counts / total_counts).idxmax()
per_richest_country = float(round((rich_counts / total_counts).max() * 100, 1))

print(f"The country with the highest percentage of high earners over average earners is {richest_country}, with a {per_richest_country}% of the total earning over 50K USD.")

The country with the highest percentage of high earners over average earners is Iran, with a 41.9% of the total earning over 50K USD.

### Fifth question:

##### Identify the most popular occupation for those who earn >50K in India.

In [233]:
df.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [260]:
rich_ind = df[(df['salary'] == '>50K') & (df['native-country'] == 'India')]
rich_ind_occ = rich_ind['occupation'].value_counts().idxmax()
print(f"The most popular occupation for Indian workers earning above $50K is {rich_ind_occ}.")

The most popular occupation for Indian workers earning above $50K is Prof-specialty.